---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentSynchronizedWithCentralEventArgs
source: html/ff0bae6e-c1b8-7b7a-cbc9-3b419b7b0c48.htm
---
# Autodesk.Revit.DB.Events.DocumentSynchronizedWithCentralEventArgs

The event arguments used by the DocumentSynchronizedWithCentralEventArgs event.

## Syntax (C#)
```csharp
public class DocumentSynchronizedWithCentralEventArgs : RevitAPIPostDocEventArgs
```